src/CF/DocumentJournals/ДокументыДвиженийТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыДвиженийТовара</Name>
			<RegisteredDocuments>
				<xr:Item>Document.РасходыТовара</xr:Item>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.ПеремещенияТовара</xr:Item>
				<xr:Item>Document.ОтчетКомиссионера</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>ВалютаДенег</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.Валюта</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Валюта</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидДокумента</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ВидДокумента</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ВидДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидЦен</Name>
					<References>
						<xr:Item>Document.ПеремещенияТовара.Attribute.ВидЦен</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.ВидЦен</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ВидЦен</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДвижениеДенег</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ВыбылоДенег</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ПоступилоДенег</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Договор</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.Договор</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Договор</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЗаказДатаПлана</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ЗаказДатаПлана</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ЗаказДатаПлана</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЗаказДатаФакта</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ЗаказДатаФакта</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ЗаказДатаФакта</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ЗаказКлиента</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ЗаказКлиента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЗаказНомерПриРегистрации</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ЗаказНомерПриРегистрации</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ЗаказНомерПриРегистрации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЗаказОплачен</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ЗаказОплачен</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ЗаказОплачен</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЗаказСогласован</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ЗаказСогласован</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ЗаказСогласован</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ПеремещенияТовара.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Контрагент</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.КлиентПоставщик</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.КлиентПоставщик</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.Организация</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Склад</Name>
					<References>
						<xr:Item>Document.ПеремещенияТовара.Attribute.Склад</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.Склад</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Склад</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ТовараВКоличестве</Name>
					<References>
						<xr:Item>Document.ПеремещенияТовара.Attribute.ТовараВКоличестве</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.ТовараВКоличестве</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ТовараВКоличестве</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ТовараНаСумму</Name>
					<References>
						<xr:Item>Document.ПеремещенияТовара.Attribute.ТовараНаСумму</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.ТовараНаСумму</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ТовараНаСумму</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЭтоЗаказ</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ЭтоЗаказ</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ЭтоЗаказ</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/CF/Documents/ПеремещенияТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПеремещенияТовара</Name>
			<BasedOn>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.КорректировкиИРегистрацияОстатков</xr:Item>
				<xr:Item>Document.УстановкиЦен</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Товары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТовараНаСумму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТовараВКоличестве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладВПути</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТалонТрек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварОтправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОСтроке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CF/DocumentJournals/ДокументыДвиженийТовара/Forms/ФормаСписка/Ext/Form/Module.bsl
//sza140420-1552 SZA: 
//sza140110-2332 : 

&НаКлиенте
Процедура ОтборПоСкладуПриИзменении(Элемент)
	ОтборПоСкладуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПоСкладуПриИзмененииНаСервере()
	
	Список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьОтборПоСкладу", не ЗначениеЗаполнено(ОтборПоСкладу));
	Список.Параметры.УстановитьЗначениеПараметра("Склад", ОтборПоСкладу);
	Список.Параметры.УстановитьЗначениеПараметра("БезПеремещенийИВозвратов", БезПеремещенийИВозвратов);
	Элементы.ФормаСоздатьПеремещение.Видимость = НЕ БезПеремещенийИВозвратов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если ЗначениеЗаполнено(параметры.Склад) Тогда
		ОтборПоСкладу = параметры.Склад;
	КонецЕсли;
	
	ОтборПоСкладуПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура БезПеремещенийИВозвратовПриИзменении(Элемент)
	ОтборПоСкладуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000370", ЭтаФорма, Отказ, );	
	
	Если НЕ Отказ Тогда
		ИспользоватьУчетПоСкладам = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам");
		Список.Параметры.УстановитьЗначениеПараметра("ПустойПоставщик", ПредопределенноеЗначение("Справочник.Поставщики.ПустаяСсылка"));
		Список.Параметры.УстановитьЗначениеПараметра("ПустойКлиент", ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка"));
		
		Если ИспользоватьУчетПоСкладам Тогда
			Элементы.БезПеремещенийИВозвратов.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Без перемещений, документов оприходования, списания и возврата товаров");
		Иначе
			Элементы.БезПеремещенийИВозвратов.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Без документов оприходования, списания и возврата товаров");
		КонецЕсли;
		
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТовараВКоличестве, , Истина);	
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРасход(Команда)
	
	ФормаДокумента = ПолучитьФорму("Документ.РасходыТовара.ФормаОбъекта");
	ФормаДокумента.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступление(Команда)
	
	ФормаДокумента = ПолучитьФорму("Документ.ПоступленияТовара.ФормаОбъекта");
	ФормаДокумента.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказаПоставщику(Команда)
	
	ПараметрыФормы = Новый Структура("ЭтоЗаказ", Истина);
	ФормаДокумента = ПолучитьФорму("Документ.ПоступленияТовара.ФормаОбъекта", ПараметрыФормы);
	ФормаДокумента.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказКлиента(Команда)
	
	ПараметрыФормы = Новый Структура("ЭтоЗаказ", Истина);
	ФормаДокумента = ПолучитьФорму("Документ.РасходыТовара.ФормаОбъекта", ПараметрыФормы);
	ФормаДокумента.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПеремещение(Команда)
	
	ФормаДокумента = ПолучитьФорму("Документ.ПеремещенияТовара.ФормаОбъекта");
	ФормаДокумента.Открыть();
	
КонецПроцедуры
